#+TITLE: Quantum Harmonic Oscillator: A Masterclass in Computational Physics with Python and Comprehensive Testing
#+AUTHOR: A Complete Guide to Scientific Computing with Test-Driven Development
#+DATE: \today
#+EMAIL: computational.physics@example.com
#+STARTUP: latexpreview inlineimages
#+OPTIONS: toc:3 num:t H:5 ^:{} tags:nil
#+PROPERTY: header-args:python :session qho_master :results output :exports both
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage{amsmath,physics,siunitx,booktabs,graphicx,listings,hyperref}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}

*** Environment Setup with Testing Infrastructure

#+begin_src jupyter-python
"""
Quantum Harmonic Oscillator Computational Physics Masterclass
Environment setup with testing infrastructure
"""
import numpy as np
import scipy as sp
from scipy import linalg, integrate, special, optimize
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from typing import List, Dict, Tuple, Optional, Union, Any, Callable
from dataclasses import dataclass, field
from functools import wraps, lru_cache
from abc import ABC, abstractmethod
import warnings
import logging

# Testing imports
import pytest
from hypothesis import given, strategies as st, settings
from hypothesis import assume, note
import coverage

warnings.filterwarnings('ignore')

# Configure logging
logging.basicConfig(
    level=logging.INFO,
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s'
)
logger = logging.getLogger(__name__)

# Plotting configuration
plt.style.use('seaborn-v0_8-darkgrid')
sns.set_palette("husl")
plt.rcParams['figure.figsize'] = (10, 6)
plt.rcParams['font.size'] = 11
plt.rcParams['text.usetex'] = False

# Physical constants (atomic units: ℏ = m = ω = 1)
HBAR = 1.0
MASS = 1.0
OMEGA = 1.0

# Numerical parameters
N_POINTS = 512
X_MAX = 10.0

# Testing parameters
TOLERANCE_ENERGY = 1e-6
TOLERANCE_NORM = 1e-3
TOLERANCE_ORTHOGONAL = 1e-10

np.random.seed(42)

logger.info("✓ Environment initialized with testing infrastructure!")
logger.info(f"  NumPy version: {np.__version__}")
logger.info(f"  SciPy version: {sp.__version__}")
logger.info(f"  pytest available for testing")
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
: [31m---------------------------------------------------------------------------[39m
: [31mModuleNotFoundError[39m                       Traceback (most recent call last)
: [36mCell[39m[36m [39m[32mIn[1][39m[32m, line 19[39m
: [32m     16[39m [38;5;28;01mimport[39;00m[38;5;250m [39m[34;01mlogging[39;00m
: [32m     18[39m [38;5;66;03m# Testing imports[39;00m
: [32m---> [39m[32m19[39m [38;5;28;01mimport[39;00m[38;5;250m [39m[34;01mpytest[39;00m
: [32m     20[39m [38;5;28;01mfrom[39;00m[38;5;250m [39m[34;01mhypothesis[39;00m[38;5;250m [39m[38;5;28;01mimport[39;00m given, strategies [38;5;28;01mas[39;00m st, settings
: [32m     21[39m [38;5;28;01mfrom[39;00m[38;5;250m [39m[34;01mhypothesis[39;00m[38;5;250m [39m[38;5;28;01mimport[39;00m assume, note
:
: [31mModuleNotFoundError[39m: No module named 'pytest'
:END:

